In [1]:
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
from bokeh.plotting import figure, output_file, show
from bokeh.layouts import gridplot

## Generate Pandas Data

In [2]:
A = pd.Series([2,3,4,5],index=['a','b','c','d'])

In [3]:
print(A.values)
print(type(A))
print(type(A.values))

[2 3 4 5]
<class 'pandas.core.series.Series'>
<class 'numpy.ndarray'>

In [4]:
A.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [5]:
print(A['a'])

2

### Slicing

In [6]:
A['a':'c']

a    2
b    3
c    4
dtype: int64

In [7]:
A[0:2]

a    2
b    3
dtype: int64

## Generate Sereis Data from Dictionary

In [8]:
grades_dict={'A':4,'A-':3.5,'B':3,'B-':2.5,'B':2}
grades=pd.Series(grades_dict)

marks_dict={'A':85,'A-':80,'B':75,'B-':70,'B':65}
marks=pd.Series(marks_dict)

In [9]:
print(grades.values)
print(grades.index)
print(grades.head())

[4.  3.5 2.  2.5]
Index(['A', 'A-', 'B', 'B-'], dtype='object')
A     4.0
A-    3.5
B     2.0
B-    2.5
dtype: float64

## Data Frame

In [10]:
D =pd.DataFrame({'Marks':marks,"Grades":grades})

In [11]:
D.head()

    Marks  Grades
A      85     4.0
A-     80     3.5
B      65     2.0
B-     70     2.5

### Transpose

In [12]:
D.T

           A    A-     B    B-
Marks   85.0  80.0  65.0  70.0
Grades   4.0   3.5   2.0   2.5

In [13]:
D.values

array([[85. ,  4. ],
       [80. ,  3.5],
       [65. ,  2. ],
       [70. ,  2.5]])

### Accessing Values

In [14]:
D.values[2,0]

65.0

In [15]:
D.columns

Index(['Marks', 'Grades'], dtype='object')

In [16]:
D['ScaledMarks']=100*(D['Marks']/90)
D

    Marks  Grades  ScaledMarks
A      85     4.0    94.444444
A-     80     3.5    88.888889
B      65     2.0    72.222222
B-     70     2.5    77.777778

### Delete a Column

In [17]:
del D['ScaledMarks']
D

    Marks  Grades
A      85     4.0
A-     80     3.5
B      65     2.0
B-     70     2.5

### Accessing Certain Records

In [18]:
G = D[D['Marks']>70]
G

    Marks  Grades
A      85     4.0
A-     80     3.5

## Dealing with Missing Values i.e NaN

In [19]:
A=pd.DataFrame([{'a':1,'b':4},{'b':-3,'c':9}])
A

     a  b    c
0  1.0  4  NaN
1  NaN -3  9.0

### Fill with 0

In [20]:
A.fillna(0)

     a  b    c
0  1.0  4  0.0
1  0.0 -3  9.0

### Drop All NaN Vals

In [21]:
A.dropna()

Empty DataFrame
Columns: [a, b, c]
Index: []

## Explicit and Implicit Indicies

In [22]:
A= pd.Series(['a','b','c'],index=[1,3,5])

In [23]:
A[1]

'a'

### loc

In [24]:
A.loc[1:3]

1    a
3    b
dtype: object

### iloc

This is just like numpy

In [25]:
A.iloc[1:3]

3    b
5    c
dtype: object

## Testing on Covid Dataset

In [26]:
df=pd.read_csv('/Users/mohsin/Desktop/Personal Stuff/Python Cheat Sheets/Datasets/covid_19_data.csv')

In [27]:
df.head()

,SNo,ObservationDate,Province/State,Country/Region,Last Update,Confirmed,Deaths,Recovered
0,1,1/22/2020,Anhui,Mainland China,1/22/2020 17:00,1,0,0
1,2,1/22/2020,Beijing,Mainland China,1/22/2020 17:00,14,0,0
2,3,1/22/2020,Chongqing,Mainland China,1/22/2020 17:00,6,0,0
3,4,1/22/2020,Fujian,Mainland China,1/22/2020 17:00,1,0,0
4,5,1/22/2020,Gansu,Mainland China,1/22/2020 17:00,0,0,0

### Dropping a Columns

In [28]:
# What inplace= True does is that it updates the orginal dataset to0
df.drop(['SNo','Last Update'],axis=1,inplace=True)

In [29]:
df.head()

  ObservationDate Province/State  Country/Region  Confirmed  Deaths  Recovered
0       1/22/2020          Anhui  Mainland China          1       0          0
1       1/22/2020        Beijing  Mainland China         14       0          0
2       1/22/2020      Chongqing  Mainland China          6       0          0
3       1/22/2020         Fujian  Mainland China          1       0          0
4       1/22/2020          Gansu  Mainland China          0       0          0

### Rename Column Headings

In [30]:
df.rename(columns={'ObservationDate':'Date','Province/State':'Province','Country/Region':'Country'},inplace=True)
df.head()

        Date   Province         Country  Confirmed  Deaths  Recovered
0  1/22/2020      Anhui  Mainland China          1       0          0
1  1/22/2020    Beijing  Mainland China         14       0          0
2  1/22/2020  Chongqing  Mainland China          6       0          0
3  1/22/2020     Fujian  Mainland China          1       0          0
4  1/22/2020      Gansu  Mainland China          0       0          0

### Converting Date Format

In [31]:
df['Date']=pd.to_datetime(df['Date'])
df.head()

        Date   Province         Country  Confirmed  Deaths  Recovered
0 2020-01-22      Anhui  Mainland China          1       0          0
1 2020-01-22    Beijing  Mainland China         14       0          0
2 2020-01-22  Chongqing  Mainland China          6       0          0
3 2020-01-22     Fujian  Mainland China          1       0          0
4 2020-01-22      Gansu  Mainland China          0       0          0

### Describe the Data

In [32]:
df.describe()

          Confirmed       Deaths     Recovered
count   6162.000000  6162.000000   6162.000000
mean     588.957481    18.960240    220.271503
std     4908.724815   198.962911   2466.089672
min        0.000000     0.000000      0.000000
25%        2.000000     0.000000      0.000000
50%       11.000000     0.000000      0.000000
75%      100.000000     1.000000     12.000000
max    67798.000000  3099.000000  55142.000000

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6162 entries, 0 to 6161
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       6162 non-null   datetime64[ns]
 1   Province   3700 non-null   object
 2   Country    6162 non-null   object
 3   Confirmed  6162 non-null   int64
 4   Deaths     6162 non-null   int64
 5   Recovered  6162 non-null   int64
dtypes: datetime64[ns](1), int64(3), object(2)
memory usage: 289.0+ KB

In [34]:
df=df.fillna("NA")

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6162 entries, 0 to 6161
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       6162 non-null   datetime64[ns]
 1   Province   6162 non-null   object
 2   Country    6162 non-null   object
 3   Confirmed  6162 non-null   int64
 4   Deaths     6162 non-null   int64
 5   Recovered  6162 non-null   int64
dtypes: datetime64[ns](1), int64(3), object(2)
memory usage: 289.0+ KB

## Group By

In [36]:
df.head(10)

        Date   Province         Country  Confirmed  Deaths  Recovered
0 2020-01-22      Anhui  Mainland China          1       0          0
1 2020-01-22    Beijing  Mainland China         14       0          0
2 2020-01-22  Chongqing  Mainland China          6       0          0
3 2020-01-22     Fujian  Mainland China          1       0          0
4 2020-01-22      Gansu  Mainland China          0       0          0
5 2020-01-22  Guangdong  Mainland China         26       0          0
6 2020-01-22    Guangxi  Mainland China          2       0          0
7 2020-01-22    Guizhou  Mainland China          1       0          0
8 2020-01-22     Hainan  Mainland China          4       0          0
9 2020-01-22      Hebei  Mainland China          1       0          0

In [37]:
df2=df.groupby('Country')[['Country','Confirmed','Deaths','Recovered']].sum().reset_index()

In [38]:
df2

                            Country  Confirmed  Deaths  Recovered
0                        Azerbaijan          1       0          0
1                   ('St. Martin',)          2       0          0
2                       Afghanistan         95       0          1
3                           Albania        211       6          0
4                           Algeria        340      14         52
..                              ...        ...     ...        ...
166                      Uzbekistan          7       0          0
167                    Vatican City          4       0          0
168                       Venezuela         29       0          0
169                         Vietnam        915       0        470
170  occupied Palestinian territory         25       0          0

[171 rows x 4 columns]

In [39]:
df2=df.groupby(['Country','Date'])[['Country','Confirmed','Deaths','Recovered']].sum().reset_index()

In [40]:
df2

                             Country       Date  Confirmed  Deaths  Recovered
0                         Azerbaijan 2020-02-28          1       0          0
1                    ('St. Martin',) 2020-03-10          2       0          0
2                        Afghanistan 2020-02-24          1       0          0
3                        Afghanistan 2020-02-25          1       0          0
4                        Afghanistan 2020-02-26          1       0          0
...                              ...        ...        ...     ...        ...
2897  occupied Palestinian territory 2020-03-11          0       0          0
2898  occupied Palestinian territory 2020-03-12          0       0          0
2899  occupied Palestinian territory 2020-03-14          0       0          0
2900  occupied Palestinian territory 2020-03-15          0       0          0
2901  occupied Palestinian territory 2020-03-16          0       0          0

[2902 rows x 5 columns]

### Applying Conditions

In [41]:
df3=df2[df2['Confirmed']>100]

In [42]:
df3

        Country       Date  Confirmed  Deaths  Recovered
152   Australia 2020-03-10        107       3         21
153   Australia 2020-03-11        128       3         21
154   Australia 2020-03-12        128       3         21
155   Australia 2020-03-13        200       3         23
156   Australia 2020-03-14        250       3         23
...         ...        ...        ...     ...        ...
2763         US 2020-03-12       1663      40         12
2764         US 2020-03-13       2179      47         12
2765         US 2020-03-14       2726      54         12
2766         US 2020-03-15       3499      63         12
2767         US 2020-03-16       4632      85         17

[470 rows x 5 columns]

## Pandas In Practise (Lec 119)

In [43]:
df=pd.read_csv(r'/Users/mohsin/Desktop/Personal Stuff/Python Cheat Sheets/Datasets/adult.data')

### Showing Data

In [44]:
df.head()

,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

### Printing Shape

In [45]:
df.shape

(32560, 15)

### Printing Columns

In [46]:
df.columns

Index(['39', ' State-gov', ' 77516', ' Bachelors', ' 13', ' Never-married',
       ' Adm-clerical', ' Not-in-family', ' White', ' Male', ' 2174', ' 0',
       ' 40', ' United-States', ' <=50K'],
      dtype='object')

### Replacing Column Names

In [47]:
df.columns = ['C' + str(x) for x in range(df.shape[1])]

In [48]:
df.columns

Index(['C0', 'C1', 'C2', 'C3', 'C4', 'C5', 'C6', 'C7', 'C8', 'C9', 'C10',
       'C11', 'C12', 'C13', 'C14'],
      dtype='object')

### Printing a Certain Column/Columns

In [49]:
df['C0']

0        50
1        38
2        53
3        28
4        37
         ..
32555    27
32556    40
32557    58
32558    22
32559    52
Name: C0, Length: 32560, dtype: int64

#### Through loc

In [50]:
df.loc[:,'C3']

0          Bachelors
1            HS-grad
2               11th
3          Bachelors
4            Masters
            ...
32555     Assoc-acdm
32556        HS-grad
32557        HS-grad
32558        HS-grad
32559        HS-grad
Name: C3, Length: 32560, dtype: object

#### Multiple Columns

##### Wtih loc

In [51]:
df.loc[:,['C0','C14']]

       C0     C14
0      50   <=50K
1      38   <=50K
2      53   <=50K
3      28   <=50K
4      37   <=50K
...    ..     ...
32555  27   <=50K
32556  40    >50K
32557  58   <=50K
32558  22   <=50K
32559  52    >50K

[32560 rows x 2 columns]

#####  With iloc

In [52]:
df.iloc[:,[1,5]]

                      C1                   C5
0       Self-emp-not-inc   Married-civ-spouse
1                Private             Divorced
2                Private   Married-civ-spouse
3                Private   Married-civ-spouse
4                Private   Married-civ-spouse
...                  ...                  ...
32555            Private   Married-civ-spouse
32556            Private   Married-civ-spouse
32557            Private              Widowed
32558            Private        Never-married
32559       Self-emp-inc   Married-civ-spouse

[32560 rows x 2 columns]

### Unique Values

In [53]:
L=df['C14'].unique()
print(L[0])
print(L[1])

 <=50K
 >50K

### Changing Values

In [54]:
idx = df['C14']==L[0]

In [55]:
df['C14'].loc[idx] = -1

/var/folders/g8/3xhdztt918n5fr0997gcttmr0000gp/T/ipykernel_62612/3483701917.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['C14'].loc[idx] = -1

In [56]:
df['C14'].loc[~idx] = 1

/var/folders/g8/3xhdztt918n5fr0997gcttmr0000gp/T/ipykernel_62612/1980075394.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['C14'].loc[~idx] = 1

In [57]:
df

,C0,C1,C2,C3,C4,C5,C6,C7,C8,C9,C10,C11,C12,C13,C14
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,-1
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,-1
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,-1
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,-1
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,-1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32555,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,-1
32556,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,1
32557,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,-1
32558,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,-1
32559,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,1

## Hot Encoding

### Single Column

In [58]:
df['C1'].unique().size

9

In [59]:
df = pd.get_dummies(df,columns=['C1'])

In [60]:
df

,C0,C2,C3,C4,C5,C6,C7,C8,C9,C10,...,C14,C1_ ?,C1_ Federal-gov,C1_ Local-gov,C1_ Never-worked,C1_ Private,C1_ Self-emp-inc,C1_ Self-emp-not-inc,C1_ State-gov,C1_ Without-pay
0,50,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,...,-1,0,0,0,0,0,0,1,0,0
1,38,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,...,-1,0,0,0,0,1,0,0,0,0
2,53,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,...,-1,0,0,0,0,1,0,0,0,0
3,28,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,...,-1,0,0,0,0,1,0,0,0,0
4,37,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,...,-1,0,0,0,0,1,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32555,27,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,...,-1,0,0,0,0,1,0,0,0,0
32556,40,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,...,1,0,0,0,0,1,0,0,0,0
32557,58,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,...,-1,0,0,0,0,1,0,0,0,0
32558,22,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,...,-1,0,0,0,0,1,0,0,0,0
32559,52,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,...,1,0,0,0,0,0,1,0,0,0

### Multiple Columns

In [61]:
df2 = pd.get_dummies(df,columns=['C1','C14'])

KeyError: "['C1'] not in index"

In [ ]:
df2

## Group By

In [62]:
df=pd.read_csv(r'/Users/mohsin/Desktop/Personal Stuff/Python Cheat Sheets/Datasets/adult.data')
df.columns = ['C' + str(x) for x in range(df.shape[1])]

In [63]:
df = pd.DataFrame({'ProductName':['Bulb','Bulb','Fan','Fan'],
                  'Type':['A','B','A','A'],
                   'EC':[400.,300.,250.,300.]
                  })
df.head()

  ProductName Type     EC
0        Bulb    A  400.0
1        Bulb    B  300.0
2         Fan    A  250.0
3         Fan    A  300.0

In [64]:
df.groupby(['ProductName']).sum()

                EC
ProductName
Bulb         700.0
Fan          550.0

In [65]:
df.groupby(['ProductName']).mean()

                EC
ProductName
Bulb         350.0
Fan          275.0

In [66]:
df.groupby([df.Type]).mean()

              EC
Type
A     316.666667
B     300.000000

In [67]:
df.groupby([df.ProductName,df.Type]).sum()

                     EC
ProductName Type
Bulb        A     400.0
            B     300.0
Fan         A     550.0

## Hierarchical Indexing

In [68]:
A = [['Bulb','Bulb','Bulb','Fan','Fan','Fan',],
     ['A','B','C','A','B','C']
                  ]
indx = pd.MultiIndex.from_arrays(A,names=('ProductName','Type'))
df = pd.DataFrame({'EC':[20,30,40,25,10,30]},index=indx)

In [69]:
df

                  EC
ProductName Type
Bulb        A     20
            B     30
            C     40
Fan         A     25
            B     10
            C     30

### Group by

In [70]:
df.groupby(level=0).sum()

             EC
ProductName
Bulb         90
Fan          65

In [71]:
df.groupby(level="ProductName").sum()

             EC
ProductName
Bulb         90
Fan          65

## Where

In [72]:
df = pd.DataFrame(np.arange(10).reshape(5,2),columns=['A','B'])

In [73]:
df

   A  B
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [74]:
df.where(df<5,-df)

   A  B
0  0  1
1  2  3
2  4 -5
3 -6 -7
4 -8 -9

In [75]:
idx = (df < 5) |( df % 3)
df.where(idx,-df)

   A  B
0  0  1
1  2  3
2  4  5
3 -6  7
4  8 -9

In [76]:
df[~(df<5)] = -df
df

   A  B
0  0  1
1  2  3
2  4 -5
3 -6 -7
4 -8 -9

## Clip

In [81]:
df= pd.DataFrame(np.random.randint(0,50,(5,10)),columns=list('ABCDEFGHIJ'))

In [82]:
df.head()

    A   B   C   D   E   F   G   H   I   J
0  36  17  22   5  40  19  49   6   2  28
1  14  29  26  16  32  48   6  14   1  22
2  45  21   9  40  40  32  49  34  42   4
3   7  31  47  11  33  28  25  39  30   2
4  40   1   8   6   5   4  45  37  41  25

In [84]:
df.clip(10,30)
# OR
# df[df<10] = 10
# df[df<30] = 130

    A   B   C   D   E   F   G   H   I   J
0  30  17  22  10  30  19  30  10  10  28
1  14  29  26  16  30  30  10  14  10  22
2  30  21  10  30  30  30  30  30  30  10
3  10  30  30  11  30  28  25  30  30  10
4  30  10  10  10  10  10  30  30  30  25

## Merge

In [92]:
df1=pd.DataFrame({'E':['B','J','L','S'],
                  'G':['A','E','E','H']})
df2=pd.DataFrame({'E':['L','B','J','S'],
                  'H':[2004,2008,2012,2018]})

In [93]:
df1.head()

   E  G
0  B  A
1  J  E
2  L  E
3  S  H

In [94]:
df2.head()

   E     H
0  L  2004
1  B  2008
2  J  2012
3  S  2018

In [95]:
[df1,df2]

[   E  G
 0  B  A
 1  J  E
 2  L  E
 3  S  H,
    E     H
 0  L  2004
 1  B  2008
 2  J  2012
 3  S  2018]

In [102]:
df3 = pd.merge(df1,df2)

### using `on` parameter (NOT COMPLETE LEC 131)

In [108]:
df4 = pd.DataFrame({'G':['A','E','H'],
                    'S':['C','G','S']})
print(df3.head(),'\n')
print(df4.head())

   E  G     H
0  B  A  2008
1  J  E  2012
2  L  E  2004
3  S  H  2018

   G  S
0  A  C
1  E  G
2  H  S

In [104]:
pd.merge(df3,df4,on='G')

   E  G     H  S
0  B  A  2008  C
1  J  E  2012  G
2  L  E  2004  G
3  S  H  2018  S

## Pivot Table (Do This Again Lec 134)

In [109]:
from seaborn import load_dataset

In [110]:
T = load_dataset('titanic')

In [111]:
T.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### Rename a column

In [113]:
T.rename(columns={'sex':"Gender"},inplace=True)

### Checking deck column null values

In [114]:
T.deck.isnull().sum()

688

### Droping `deck` column

In [ ]:
T.drop(['deck'],axis=1,inplace=True)

### Group by

In [118]:
T.groupby(['Gender','class'])['survived'].mean()

Gender  class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [120]:
T.groupby(['Gender','class'])['survived'].mean().unstack()

class      First    Second     Third
Gender
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

### Pivot Table

In [124]:
T.pivot_table('survived',index="Gender",columns='class',aggfunc='mean')

class      First    Second     Third
Gender
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

### Partitions

In [125]:
agePartitions = pd.cut(T['age'],[0,18,80])

In [126]:
agePartitions

0      (18.0, 80.0]
1      (18.0, 80.0]
2      (18.0, 80.0]
3      (18.0, 80.0]
4      (18.0, 80.0]
           ...
886    (18.0, 80.0]
887    (18.0, 80.0]
888             NaN
889    (18.0, 80.0]
890    (18.0, 80.0]
Name: age, Length: 891, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 80]]

In [129]:
T.pivot_table('survived',['Gender',agePartitions],columns='class')

class               First    Second     Third
Gender age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

## Strings

In [131]:
from seaborn import load_dataset

In [139]:
T = load_dataset('titanic')

In [140]:
T.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [141]:
T.sex.str.upper()
#         .len()
#         .lower
#         .capitalize
#         .cat

0        MALE
1      FEMALE
2      FEMALE
3      FEMALE
4        MALE
        ...
886      MALE
887    FEMALE
888    FEMALE
889      MALE
890      MALE
Name: sex, Length: 891, dtype: object

### split

In [142]:
"abc,fgg,des".split(',')

['abc', 'fgg', 'des']

In [145]:
T.sex.str.split(',')

0        [male]
1      [female]
2      [female]
3      [female]
4        [male]
         ...
886      [male]
887    [female]
888    [female]
889      [male]
890      [male]
Name: sex, Length: 891, dtype: object

## Date Time

In [148]:
from datetime import datetime
from seaborn import load_dataset
T = load_dataset('titanic')

In [150]:
dates = pd.to_datetime([datetime(2010,7,3),'10th of July, 2018','2017-Jul-19','10-09-2016','20160305'])

In [151]:
dates

DatetimeIndex(['2010-07-03', '2018-07-10', '2017-07-19', '2016-10-09',
               '2016-03-05'],
              dtype='datetime64[ns]', freq=None)

In [158]:
dates.to_period('S')
#               ' '

PeriodIndex(['2010-07-03 00:00:00', '2018-07-10 00:00:00',
             '2017-07-19 00:00:00', '2016-10-09 00:00:00',
             '2016-03-05 00:00:00'],
            dtype='period[S]')

In [159]:
dates-dates[0]

TimedeltaIndex(['0 days', '2929 days', '2573 days', '2290 days', '2072 days'], dtype='timedelta64[ns]', freq=None)